Для выполнения лабораторной работы использую эмулятор EVE-NG, терминальный клиент PuTTY.
В качестве роутера (R1) использовала образ: Cisco IOS Software, IOSv Software (VIOS-ADVENTERPRISEK9-M), Version 15.6(2)T.

Необходимо настроить оборудование и организовать сетевую связанность согласно условию лабораторной работы.
1. Создание сети и настройка основных параметров устройства.
2. Создание сетей VLAN и назначение портов коммутатора
3. Настройка магистрали 802.1Q между коммутаторами
4. Настройка маршрутизации между VLAN на маршрутизаторе
5. Убедитесь, что маршрутизация между VLAN работает



Настройка основных параметров роутера (R1):
1. Подключилась консолью к роутеру.
2. Для перехода в превилигированный режим использовала команду:
	Router>enable
3. Для перехода в рехим конфигурации используется команда:
	Router#configure terminal
4. Назначила имя роутеру:
	Router(config)#hostname R1
5. Отключила поиск DNS:
	R1(config)#no ip domain-lookup
6. Назначила class как привилегированный зашифрованный пароль EXEC:
	R1(config)#enable password level 15 class
7. Назначила cisco в качестве пароля консоли и включила вход:
	R1(config)#line console 0
	R1(config-line)#password cisco
	R1(config-line)#login
	R1(config-line)#exit
8. Назначила cisco в качестве пароля VTY и включила вход:
	R1(config)#line vty 0 15
	R1(config-line)#password cisco
	R1(config-line)#login
	R1(config-line)#exit
9. Зашифровала пароль:
	R1(config)#service password-encryption
10. Создала баннер, предупреждающий любого, кто получает доступ к устройству, о запрещении несанкционированного доступа:
	R1(config)#banner motd >
!--------------------------------------!
!                                      !
!                 STOP                 !
!   Unauthorized entry is prohibited   !
!                                      !
!--------------------------------------!
>
11. Сохранила текущую конфигурацию в файл стартовой конфигурации.
	R1#copy running-config startup-config
12. Установила время на роутере:
	R1#clock set 21:06:45 29 September 2020

	
	
	
conf terminal
!
hostname R1
no ip domain-lookup
enable password level 15 0 class
!
line console 0
password cisco
login
exit
!
line vty 0 15
password cisco
login
exit
!
service password-encryption
!
banner motd >
!--------------------------------------!
!                                      !
!                 STOP                 !
!   Unauthorized entry is prohibited   !
!                                      !
!--------------------------------------!
>
!
exit
!
copy running-config startup-config

!
clock set 21:06:45 29 September 2020
!

	
	
	
	
	
	

